"""สร้างกล่องข้อความ"""
def main():
    """print สร้างกล่องข้อความ"""
    txt = int(input())
    print("""-------------------------
|                       |
|                       |
|                       |
|   Pre-Progamming 65   |
|                       |
|                       |
|                       |
-------------------------""")
    print("""|                       |
|                       |
|                       |
|   Pre-Progamming 65   |
|                       |
|                       |
|                       |
-------------------------\n"""*(txt-1), end="")

main()
